package com.ix.ibrahim7.ps.text.jerusalemapp.model

import android.app.Activity
import com.ix.ibrahim7.ps.text.jerusalemapp.R
import java.util.*

data class Occasions(
    val title:String,
    val occasions_id:String="",
    val description:String = "",
    val date: String=""
)


fun Activity.getOccasionsData() =   arrayListOf(
    Occasions("ثورة البراق: أول تظاهرات عامة ضد هجرة اليهود إلى فلسطين",description = "البراق هو جزء من الحائط الغربي للحرم القدسي الشريف وقد كان ادعاء اليهود بملكيته سبباً في التوتر الذي نجمت عنه اضطرابات عنيفة في آب من عام 1929 بين العرب واليهود في القدس، وفي أنحاء عديدة من فلسطين وهو ما عرف بـ \"ثورة البراق\".\n" +
            "لا يوجد مكان على الأرض تتنازعه مشاعر المسلمين وأتباع اليهودية مثلما هو الحائط الغربي للحرم القدسي الشريف، فهو يمثل بالنسبة لليهود آخر ما تبقى من هيكل سليمان، الذي يهوي إليه فؤاد اليهودي منذ أن دمر الرومان الهيكل عام 70م وشتتوا عباده في كل اتجاه، وهو المكان الذي ركن إليه النبي محمد (صلى الله عليه وسلم) البراق المجنح الذي حمله من مرقده في إسرائه ومعراجه إلى السماء مروراً ببيت المقدس. يسميه اليهود \"حائط المبكى\"- حائط البكاء على ما حل بهيكلهم وأسلافهم، ويسميه المسلمون \"حائط البراق\".\n",date = "1929"),
    Occasions("استشهاد عز الدين القسام، الشيخ المقاوم في فلسطين، على أيدي البريطانيين",description = "محمد عز الدين بن عبد القادر القسام (1300هـ/1883م - 1354هـ/1935م) الشهير باسم عز الدين القسام، عالم مسلم، وداعية، ومجاهد، وقائد، ولد في بلدة جَبَلة من أعمال اللاذقية سنة 1883م، وتربى في أسرة متديّنة ومعروفة باهتمامها بالعلوم الشرعية، ثم ارتحل إلى الجامع الأزهر بالقاهرة سنة 1896م عندما بلغ الرابعة عشرة من عمره، وتخرّج منه سنة 1906م، وعاد إلى بلده جبلة، حيث عمل مدرساً وخطيباً في جامع إبراهيم بن أدهم.",date = "1935"),
    Occasions("تفجير فندق الملك داوود في القدس من قبل عصابة الأرغون الصهيونية",description = "هي عملية تفجير استهدفت الفندق، تم تنفيذها في 22 يوليو لسنة 1946. حيث قام أعضاء من جماعة الإرجون الصهيونية بتنفيذ هذا الهجوم ضد الحكومة البريطانية في فلسطين آنذاك.[1] حيث أن حكومة الانتداب جعلت من هذا الفندق مركزا لها.\n",date = "1946"),
    Occasions("إعلان قيام دولة إسرائيل، واعتراف أميركي فوري بها",description = "بادرت القيادات الإسرائيلية إلى إعلان قيام دولة إسرائيل يوم 14 مايو/أيار عام 1948 بعيد انسحاب الانتداب البريطاني، ودعت يهود الشتات للعودة إلى \"الوطن\"، مطالبة إياهم بدعم الدولة الوليدة التي سارعت الولايات المتحدة والاتحاد السوفياتي إلى الاعتراف بها بعد دقائق من إعلانها.",date = "1948"),
    Occasions("تأسيس الأونروا: وكالة الأمم المتحدة لإغاثة وتشغيل اللاجئين الفلسطينيين",description = "تأسست الأونروا من قبل الجمعية العامة للأمم المتحدة (باعتبارها جسما تابعا لها)، وهي الوكالة الأممية ... المفوضية السامية لشؤون اللاجئين ليست مسؤولة عن لاجئي فلسطين، لماذا؟ ... وكالة الأمم المتحدة لإغاثة وتشغيل اللاجئين الفلسطينيين في الشرق الأدنى",date = "1949"),
    Occasions("تأسيس منظمة التحرير الفلسطينية",description = " منظمة سياسية شبه عسكرية، معترف بها في الأمم المتحدة والجامعة العربية كممثل شرعي وحيد للشعب الفلسطيني داخل وخارج فلسطين. تأسست عام 1964 بعد انعقاد المؤتمر العربي الفلسطيني الأول في القدس نتيجة لقرار مؤتمر القمة العربي 1964 (القاهرة) لتمثيل الفلسطينيين في المحافل الدولية. وهي تضم حركة فتح والجبهة الشعبية لتحرير فلسطين بالإضافة إلى العدد الأكبر من الفصائل والأحزاب الفلسطينية تحت لوائها، باستثناءات واضحة مثل حركة حماس وحركة الجهاد الإسلامي والجبهة الشعبية لتحرير فلسطين – القيادة العامة التي علقت عضويتها. يعتبر رئيس اللجنة التنفيذية فيها، رئيسا لفلسطين والشعب الفلسطيني في الأراضي التي تسيطر عليها السلطة الفلسطينية في الضفة الغربية وقطاع غزة بالإضافة إلى فلسطينيي الشتات.",date = "1964"),
    Occasions("اعتراف جامعة الدول العربية بمنظمة التحرير الفلسطينية الممثل الشرعي والوحيد للشعب الفلسطيني",description = "توفي 14 تشرين الأول عام 1974، اعترفت الجمعية العامة للأمم المتحدة بمنظمة التحرير الفلسطينية \"الممثل الشرعي الوحيد للشعب الفلسطيني\".\n" +
            "وفي 28 تشرين الأول عام 1974، اعترفت كذلك قمة الجامعة العربية المنعقدة في الرباط بمنظمة التحرير \"الممثل الشرعي الوحيد للشعب الفلسطيني\".\n" +
            "وأعلنت منظمة التحرير الفلسطينية في 15 تشرين الثاني عام 1988 \"استقلال فلسطين\" خلال المؤتمر الـ19 للمجلس الوطني الفلسطيني المنعقد في الجزائر.",date = "1974"),
    Occasions("تأسيس مستوطنة ريشون ليتسيون في فلسطين",description = "مدينة صهيونية، وأول مستعمرة أسسها منظمة البيلو في فلسطين في موقع عيون قارة العربية عام 1882م وكان أول سكانها الذين لم يزد عددهم على عشرة أفراد من الصهيونيين المهاجرين من روسيا. وقد مكنهم مساعد القنصل البريطاني في يافا آنذاك من الحصول على 3.330 دونماً من الأرض لمستعمرتهم.",date = "1882")
)